Config/Documents/ПередачаОбъектаИК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПередачаОбъектаИК</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОС</xr:Item>
				<xr:Item>InformationRegister.СобытияОС</xr:Item>
				<xr:Item>AccumulationRegister.АмортизацияОбъектовОС</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОСПоКонтрагентам</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыРасчетовСУчредителями</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДляАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОснованияДляАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОснованияДляАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСписанияСБухУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДИсточника</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПередачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийИК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДолжностьЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФамилияЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчествоЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ВидыОперацийИК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийИК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчетуИзготовление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратУправление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратАренда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратБезвозмездноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Передача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаУправление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаАренда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаБезмозмездноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеЗабаланс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаИКПолученныхВПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаОСнаХранении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаКапвложений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеИКНаБалансе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеИКПолученноеВПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеИКнаХранении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаИКвФинансовуюАренду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаЗемУчастковВПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗемУчастковИзПользования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеКапвложенийВИК</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/СостоянияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияОС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятоКУчету</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВведеноВЭксплуатацию</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятоСУчета</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/КВД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КВД</Name>
			<Comment>Коды финансового обеспечения</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бюджет</Name>
					<Comment>Деятельность, осуществляемая за счет средств соответствующего бюджета бюджетной системы Российской Федерации (бюджетная деятельность)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внебюджет</Name>
					<Comment>Приносящая доход деятельность (собственные доходы учреждения)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноеРаспоряжение</Name>
					<Comment>Средства во временном распоряжении</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СубсидииНаГосзадание</Name>
					<Comment>Деятельность по выполнению государственного (муниципального) задания</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СубсидииНаИныеЦели</Name>
					<Comment>Деятельность, осуществляемая за счет средств субсидии на иные цели, грантов в форме субсидий</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетныеИнвестиции</Name>
					<Comment>Деятельность, осуществляемая за счет средств субсидии на цели осуществления капитальных вложений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваОМС</Name>
					<Comment>Деятельность, осуществляемая по обязательному медицинскому страхованию</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Documents/ПередачаОбъектаИК/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ВыборОСОбработан;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	УправлениеНФА.ПроверитьУчетИмуществаКазны();

	ОбщегоНазначенияБГУ.УстановитьНедоступныеЭлементыФормы(Элементы, Объект, "КомандаРассчитатьСтоимостьОС"
																			+",ВыбратьКомиссию"
																			+",ВыбратьПредседателяКомиссии"
																			+",СоставКомиссииПодобратьСотрудников");
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	// если документ скопирован или введен на основании, то чтения на сервере не было
	Если Параметры.Ключ.Пустая() И ЗначениеЗаполнено(Объект.ОсновноеСредство) Тогда
		ПрочитатьРеквизитыОС(Объект.Организация,Объект.ОсновноеСредство, ГрупповойУчет, ОС_СчетУчета,Объект.Дата);
	КонецЕсли;
	
	Элементы.Подразделение.АвтоОтметкаНезаполненного = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
														И БухгалтерскийУчетПовтИсп.ПолучитьПризнакиУчета("108.00").УчетПоПодразделениям;
														
	Если Параметры.Ключ.Пустая() И ЗначениеЗаполнено(Объект.Организация) Тогда
		УстановитьКПСиКФО();
	КонецЕсли;
	Если Параметры.Ключ.Пустая() Тогда
		УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтаФорма, Объект);
		УстановитьДоступностьСвязанныхРеквизитовОсновногоСредства(ЭтаФорма, Объект);
	КонецЕсли;
		
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	ПрочитатьРеквизитыОС(Объект.Организация,Объект.ОсновноеСредство, ГрупповойУчет, ОС_СчетУчета,Объект.Дата);
	УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтаФорма, Объект);
	УстановитьДоступностьСвязанныхРеквизитовОсновногоСредства(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);
    Оповестить("ДокументыПоУчетуИКИзменение");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ПрочитатьРеквизитыОС(Объект.Организация,Объект.ОсновноеСредство, ГрупповойУчет, ОС_СчетУчета,Объект.Дата);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если Лев(ИсточникВыбора.ИмяФормы,40) = "Справочник.ПостоянноДействующиеКомиссии." Тогда
		УправлениеОсновнымиСредствамиКлиент.УстановитьКомиссиюВДокументОС(ВыбранноеЗначение, Объект, ЭтаФорма);
	ИначеЕсли Лев(ИсточникВыбора.ИмяФормы,22) = "Справочник.Сотрудники." Тогда
		УправлениеОсновнымиСредствамиКлиент.ОбработатьВыборПредседателяКомиссии(ЭтаФорма,
																				ВыбранноеЗначение, 
																				, 
																				Объект.ДолжностьПредседателяКомиссии,
																				Объект.ФамилияПредседателяКомиссии,
																				Объект.ИмяПредседателяКомиссии,
																				Объект.ОтчествоПредседателяКомиссии);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеОсновнымиСредствамиКлиент.ПриОткрытииДокумента173н(ЭтотОбъект, "ПередачаОбъектовИК");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидПередачиПриИзменении(Элемент)
	УстановитьДоступностьСвязанныхРеквизитовВидПередачи();
	Объект.СуммаАмортизации	= 0;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		ДатаПриИзмененииНаСервере();
	КонецЕсли;
	
	УправлениеОсновнымиСредствамиКлиент.ЗапроситьИзменениеДатыСписанияСБухУчета(Объект);
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
		УстановитьКПСиКФО();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтаФорма, Объект);
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
	УстановитьКПСиКФО();
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	УстановитьДоступностьДоговора();
КонецПроцедуры

&НаКлиенте
Процедура КПСПриИзменении(Элемент)
	ОбнулитьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеСредствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыборОСОбработан = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеСредствоПриИзменении(Элемент)
	ПриИзмененииОсновногоСредства(НЕ ВыборОСОбработан, Не ЗначениеЗаполнено(Объект.ИнвентарныйНомер), Истина, Ложь);
	ВыборОСОбработан = Ложь;
	УстановитьДоступностьСвязанныхРеквизитовОсновногоСредства(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеСредствоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СоответствиеРеквизитов = Новый Соответствие;
	СоответствиеРеквизитов.Вставить("СчетУчета", 				"ОС_СчетУчета");
	СоответствиеРеквизитов.Вставить("ГрупповойУчет",		 	"ГрупповойУчет");
	СоответствиеРеквизитов.Вставить("ИнвентарныйНомер",		 	"Объект.ИнвентарныйНомер");
	УправлениеОсновнымиСредствамиКлиент.ОбработкаВыбораОсновногоСредства(ВыбранноеЗначение, Новый Структура("Форма, Объект", ЭтаФорма, Объект), СоответствиеРеквизитов, ВыборОСОбработан);
КонецПроцедуры

&НаКлиенте
Процедура ИнвентарныйНомерПриИзменении(Элемент)
	ПриИзмененииОсновногоСредства(Ложь, Ложь, Истина, Ложь);
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////////
//               ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТИПОВЫХ ОПЕРАЦИЙ                       //

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

//               ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТИПОВЫХ ОПЕРАЦИЙ                       //
/////////////////////////////////////////////////////////////////////////////////////////

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотавКомиссии

&НаКлиенте
Процедура СоставКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеОсновнымиСредствамиКлиент.ОбработатьПодборКомиссии(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаРассчитатьСтоимостьОС(Команда)
	РассчитатьСуммы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКомиссию(Команда)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Владелец", Объект.Организация));
		ОткрытьФорму("Справочник.ПостоянноДействующиеКомиссии.ФормаВыбора", ПараметрыФормы, ЭтаФорма);	
	Иначе
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Сначала необходимо выбрать организацию'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСотрудников(Команда)
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборКомиссии(Элементы.СоставКомиссии, Объект.Организация, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПредседателяКомиссии(Команда)
	УправлениеОсновнымиСредствамиКлиент.ОткрытьВыборПредседателяКомиссии(ЭтаФорма, Объект.Организация, Объект.Дата);
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьСвязанныхРеквизитовОрганизации(Форма, Объект)

	Элементы = Форма.Элементы;
	
	ДоступностьРеквизитов = ЗначениеЗаполнено(Объект.Организация);
	Элементы.Подразделение.Доступность						= ДоступностьРеквизитов;
	Элементы.ОсновноеСредство.Доступность					= ДоступностьРеквизитов;
	Элементы.КПС.Доступность								= ДоступностьРеквизитов;
	Элементы.КФО.Доступность								= ДоступностьРеквизитов;
	Элементы.ВыбратьКомиссию.Доступность					= ДоступностьРеквизитов;
	Элементы.ВыбратьПредседателяКомиссии.Доступность		= ДоступностьРеквизитов;
	Элементы.СоставКомиссииПодобратьСотрудников.Доступность	= ДоступностьРеквизитов;
	
КонецПроцедуры // УстановитьДоступностьСвязанныхРеквизитовОрганизации()
 
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьСвязанныхРеквизитовОсновногоСредства(Форма, Объект)

	Элементы = Форма.Элементы;
	
	ДоступностьРеквизитов = ЗначениеЗаполнено(Объект.ОсновноеСредство);
	Элементы.ИнвентарныйНомер.Доступность =
		ДоступностьРеквизитов И Форма.КэшПараметров.УчетнаяПолитика.ВедениеАналитическогоУчетаИмуществаКазны;
	Элементы.КомандаРассчитатьСтоимостьОС.Доступность 	= ДоступностьРеквизитов;
    УстановитьТолькоЧтениеСуммыИАмортизации(Форма);
	
КонецПроцедуры // УстановитьДоступностьСвязанныхРеквизитовОсновногоСредства()

&НаКлиенте
Процедура УстановитьДоступностьСвязанныхРеквизитовВидПередачи()
	ЭтоПередача = Объект.ВидПередачи = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.Передача");
	Если ЭтоПередача Тогда
		Элементы.Контрагент.АвтоОтметкаНезаполненного	= Ложь;
		Элементы.Контрагент.ОтметкаНезаполненного		= Ложь;
	Иначе
		Элементы.Контрагент.АвтоОтметкаНезаполненного	= Истина;
		Элементы.Контрагент.ОтметкаНезаполненного		= Не ЗначениеЗаполнено(Объект.Контрагент);
	КонецЕсли;
	
	Элементы.СуммаАмортизации.Доступность =
		ЭтоПередача И НЕ ЭтотОбъект.КэшПараметров.УчетнаяПолитика.ВедениеАналитическогоУчетаИмуществаКазны;

КонецПроцедуры // УстановитьДоступностьСвязанныхРеквизитовВидПередачи()
 
&НаКлиенте
Процедура УстановитьДоступностьДоговора()

	Элементы.Договор.Доступность = ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Контрагент);	

КонецПроцедуры // УстановитьДоступностьДоговора()

&НаКлиенте
Процедура ОбнулитьСуммы()

	Если ЭтотОбъект.КэшПараметров.УчетнаяПолитика.ВедениеАналитическогоУчетаИмуществаКазны Тогда
		Объект.Сумма 			= 0;
		Объект.СуммаАмортизации	= 0;
	КонецЕсли;

КонецПроцедуры // ОбнулитьСуммы()

&НаКлиенте
Процедура РассчитатьСуммы(СообщатьОбОшибках = Ложь)
	Если НеВсеРеквизитыДляЗаполненияЗаполнены(СообщатьОбОшибках) Тогда
		Возврат;
	КонецЕсли;
	РассчитатьБалансовуюСтоимостьИАмортизацию(Не ЗначениеЗаполнено(Объект.ИнвентарныйНомер));
КонецПроцедуры // РассчитатьСуммы()

&НаКлиенте
Процедура ПриИзмененииОсновногоСредства(ЗаполнятьРеквизитыОС, Знач ПолучатьИнвНомер, РасчитыватьСтоимость, СообщатьОбОшибках)

	Если Не ЭтотОбъект.КэшПараметров.УчетнаяПолитика.ВедениеАналитическогоУчетаИмуществаКазны Тогда
		ПолучатьИнвНомер = Ложь;
	КонецЕсли;
	Если ПолучатьИнвНомер ИЛИ РасчитыватьСтоимость Тогда
		ВсеРеквизитыЗаполнены = НЕ НеВсеРеквизитыДляИнвНомераЗаполнены(СообщатьОбОшибках);
		Если ПолучатьИнвНомер Тогда
			ПолучатьИнвНомер = ВсеРеквизитыЗаполнены;
		КонецЕсли;
		Если РасчитыватьСтоимость Тогда
			РасчитыватьСтоимость = ВсеРеквизитыЗаполнены;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаполнятьРеквизитыОС ИЛИ ПолучатьИнвНомер ИЛИ РасчитыватьСтоимость Тогда
		ОбработатьИзменениеОсновногоСредстваНаСервере(ЗаполнятьРеквизитыОС, ПолучатьИнвНомер, РасчитыватьСтоимость);
	КонецЕсли;

КонецПроцедуры // ПриИзмененииОсновногоСредства()

&НаСервере
Процедура ОбработатьИзменениеОсновногоСредстваНаСервере(ЗаполнятьРеквизитыОС, ПолучатьИнвНомер, РассчитыватьСтоимость)

	Если ЗаполнятьРеквизитыОС Тогда
		ПрочитатьРеквизитыОС(Объект.Организация,Объект.ОсновноеСредство,ГрупповойУчет,ОС_СчетУчета,Объект.Дата);
	КонецЕсли;
	
	Если ПолучатьИнвНомер И ЭтотОбъект.КэшПараметров.УчетнаяПолитика.ВедениеАналитическогоУчетаИмуществаКазны Тогда
		ПолучитьИнвентарныйНомер();
	КонецЕсли;
	
	Если РассчитыватьСтоимость Тогда
		РассчитатьБалансовуюСтоимостьИАмортизацию(Не ЗначениеЗаполнено(Объект.ИнвентарныйНомер));
	КонецЕсли;

КонецПроцедуры // ОбработатьИзменениеОсновногоСредстваНаСервере()

&НаСервере
Процедура ПолучитьИнвентарныйНомер()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МестонахождениеОССрезПоследних.ИнвНомер
	               |ПОМЕСТИТЬ Местонахождение
	               |ИЗ
	               |	РегистрСведений.МестонахождениеОС.СрезПоследних(
	               |			&Период,
	               |			Организация = &Организация
	               |				И ОсновноеСредство = &ОсновноеСредство) КАК МестонахождениеОССрезПоследних
	               |ГДЕ
	               |	МестонахождениеОССрезПоследних.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Местонахождение.ИнвНомер
	               |ИЗ
	               |	Местонахождение КАК Местонахождение
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	               |		ПО Местонахождение.ИнвНомер = ИнвентарныеНомераОС.Ссылка
	               |			И (ИнвентарныеНомераОС.Владелец = &Организация)
	               |			И (ИнвентарныеНомераОС.ОС = &ОсновноеСредство)
	               |			И (НЕ ИнвентарныеНомераОС.ПометкаУдаления)";
	Запрос.УстановитьПараметр("Организация",	 	Объект.Организация);
	Запрос.УстановитьПараметр("Период",				?(Параметры.Ключ.Пустая(), КонецДня(Объект.Дата), Объект.Ссылка.МоментВремени()));
	Запрос.УстановитьПараметр("ОсновноеСредство",	Объект.ОсновноеСредство);
	Результат = Запрос.Выполнить();
	ИнвентарныйНомер = Справочники.ИнвентарныеНомераОС.ПустаяСсылка();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Количество() = 1 Тогда
			Выборка.Следующий();
			ИнвентарныйНомер = Выборка.ИнвНомер;
		КонецЕсли;
	КонецЕсли;		
	Объект.ИнвентарныйНомер = ИнвентарныйНомер;
	
КонецПроцедуры // ПриИзмененииОсновногоСредства()
 
&НаСервере
Процедура РассчитатьБалансовуюСтоимостьИАмортизацию(УстанавливатьИнвентарныйНомер = Истина)
	
	ПараметрыПолученияОстатков = УправлениеОсновнымиСредствами.СтруктураПараметровПолученияОстатков(Объект, Объект.ДатаСписанияСБухУчета);
	ПараметрыПолученияОстатков.ПолучатьАмортизацию = Истина;
	ПараметрыПолученияОстатков.УстанавливатьИнвентарныйНомер = УстанавливатьИнвентарныйНомер;
	ПараметрыПолученияОстатков.УстанавливатьКПС = Истина;
	
	ТаблицаОстатков = УправлениеОсновнымиСредствами.ПолучитьОстатки(ПараметрыПолученияОстатков);
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ОсновноеСредство",	"ОсновноеСредство");
	ПараметрыЗаполнения.Вставить("ИнвентарныйНомер",	"ИнвентарныйНомер");
	ПараметрыЗаполнения.Вставить("Сумма",				"Сумма");
	ПараметрыЗаполнения.Вставить("КПС",					"КПС");
	ПараметрыЗаполнения.Вставить("СуммаАмортизации",	"СуммаАмортизации");
	ПараметрыЗаполнения.Вставить("ИсходноеКоличество",	1);
	
	ПараметрыЗаполнения.Вставить("УстанавливатьИнвентарныйНомер", УстанавливатьИнвентарныйНомер);
	ПараметрыЗаполнения.Вставить("УстанавливатьКПС",	Истина);
		
	УправлениеОсновнымиСредствами.ЗаполнитьОбъектИзТаблицыОстатков(ТаблицаОстатков, Объект, ПараметрыЗаполнения);
	
КонецПроцедуры // РассчитатьБалансовуюСтоимостьИАмортизацию()
 
&НаКлиенте
Функция НеВсеРеквизитыДляЗаполненияЗаполнены(СообщатьОбОшибках = Истина)

	Отказ = Ложь;
	Если ОбщегоНазначенияБГУВызовСервераПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоИФО") И НЕ ЗначениеЗаполнено(Объект.ИФО) Тогда
		Если СообщатьОбОшибках Тогда
			ТекстСообщения = НСтр("ru='Не заполнен обязательный реквизит ИФО'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ИФО",,Отказ);
		Иначе
			Отказ = Истина;
			Возврат Отказ;
		КонецЕсли;
	КонецЕсли;
	Если ОбщегоНазначенияБГУВызовСервераПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоПодразделениям")
		И БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьПризнакиУчета("108.00").УчетПоПодразделениям
		И НЕ ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Если СообщатьОбОшибках Тогда
			ТекстСообщения = НСтр("ru='Не заполнен обязательный реквизит Подразделение'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.Подразделение",,Отказ);
		Иначе
			Отказ = Истина;
			Возврат Отказ;
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.КФО) Тогда
		Если СообщатьОбОшибках Тогда
			ТекстСообщения = НСтр("ru='Не заполнен обязательный реквизит КФО'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.КФО",,Отказ);
		Иначе
			Отказ = Истина;
			Возврат Отказ;
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ОсновноеСредство) Тогда
		Если СообщатьОбОшибках Тогда
			ТекстСообщения = НСтр("ru='Не заполнен обязательный реквизит Объект'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ОсновноеСредство",,Отказ);
		Иначе
			Отказ = Истина;
			Возврат Отказ;
		КонецЕсли;
	КонецЕсли;
		
	Возврат Отказ;	

КонецФункции // НеВсеРеквизитыДляЗаполненияЗаполнены()

&НаКлиенте
Функция НеВсеРеквизитыДляИнвНомераЗаполнены(СообщатьОбОшибках = Истина)

	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.ОсновноеСредство) Тогда
		Если СообщатьОбОшибках Тогда
			ТекстСообщения = НСтр("ru='Не заполнен обязательный реквизит Объект'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ОсновноеСредство",,Отказ);
		Иначе
			Отказ = Истина;
			Возврат Отказ;
		КонецЕсли;
	КонецЕсли;
    Возврат Отказ;
	
КонецФункции // НеВсеРеквизитыДляИнвНомераЗаполнены()

&НаСервереБезКонтекста
Процедура ПрочитатьРеквизитыОС(Организация, ОсновноеСредство, ГрупповойУчет, СчетУчета, НаДату)
	
	ДанныеОбъектаОС = УправлениеОсновнымиСредствами.ДанныеОбъектаОС(ОсновноеСредство, НаДату);
	ГрупповойУчет   = ДанныеОбъектаОС.ГрупповойУчет;
	СчетУчета       = ДанныеОбъектаОС.СчетУчета;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКПСиКФО()

	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		
		ДопустимыеКФО = БухгалтерскийУчетПовтИсп.КФОПоУчетнойПолитике(
			Объект.Организация, Объект.ИФО, ЭтотОбъект.КэшПараметров.УчетнаяПолитика.ДатаПоследнегоИзменения);
		
		Если ДопустимыеКФО.Найти(ПредопределенноеЗначение("Перечисление.КВД.Бюджет"))<>Неопределено Тогда
			Объект.КФО = ПредопределенноеЗначение("Перечисление.КВД.Бюджет");
		Иначе
			Объект.КФО = ПредопределенноеЗначение("Перечисление.КВД.ПустаяСсылка");
		КонецЕсли;
	Иначе
		Объект.КФО = ПредопределенноеЗначение("Перечисление.КВД.ПустаяСсылка");
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТолькоЧтениеСуммыИАмортизации(Форма)

	ВедениеАналитическогоУчета = Форма.КэшПараметров.УчетнаяПолитика.ВедениеАналитическогоУчетаИмуществаКазны;
	Форма.Элементы.Сумма.РедактированиеТекста				= НЕ ВедениеАналитическогоУчета;
	Форма.Элементы.СуммаАмортизации.РедактированиеТекста	= НЕ ВедениеАналитическогоУчета;

КонецПроцедуры // УстановитьТолькоЧтениеСуммыИАмортизации()

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

ВыборОСОбработан = Ложь;
